{
    "AWS-Terraform-Workshop": "Beginner-friendly guide to setting up AWS infrastructure using Terraform.",
    "tf-ecr-ecs-gh-deploy": "Automated deployment of a Python application to AWS ECS using GitHub Actions, Docker, and Terraform.",
    "eks-cluster-terraform": "Terraform-based provisioning of an Amazon EKS Cluster for Kubernetes deployments.",
    "CI-CD_EKS-GitHub_Actions": "CI/CD pipeline for deploying a Node.js app on Amazon EKS using GitHub Actions, Terraform, and Kubernetes.",
    "devops-tools": "Collection of essential DevOps tools for development, deployment, monitoring, security, and automation.",
    "Certified_Kubernetes_Administrator": "Master Kubernetes from scratch and prepare for the CKA certification.",
    "kubernetes-dashboard": "Kubernetes dashboard with integrated health checks and Trivy scanning.",
    "DevOps-Projects": "Real-world DevOps projects from beginner to advanced levels.",
    "uber-clone": "Full-stack Uber-like transportation application with DevSecOps integration.",
    "kubernetes-projects-learning": "Practical Kubernetes projects to master deployment, management, and scaling of containerized applications.",
    "AWS-EKS_Terraform": "Provision Amazon EKS Cluster on AWS using Terraform.",
    "Deployment-of-super-Mario-on-Kubernetes-using-terraform": "Deploy Super Mario game on Amazon EKS using Terraform.",
    "cloud-native-monitoring-app": "Monitoring app built with Python, containerized with Docker, and deployed to EKS.",
    "Zomato-Clone": "Full-stack food delivery application inspired by Zomato with DevSecOps integration.",
    "Learning-Prometheus": "Repository for learning and implementing Prometheus monitoring in Kubernetes environments.",
    "Kubernetes": "Comprehensive Kubernetes learning and deployment repository from basic to advanced.",
    "DevOps_Setup-Installations": "Guides for installing and setting up essential DevOps and DevSecOps tools.",
    "DevOps-Tool-Installer": "Automated installation/uninstallation scripts for essential DevOps tools on Linux and Windows.",
    "kubernetes-learning-path": "Step-by-step Kubernetes learning path from beginner to advanced.",
    "Jenkins-Terraform-AWS-Infra": "Terraform scripts for AWS infrastructure provisioning with Jenkins integration.",
    "azure-all_in_one": "Curated list of Azure resources, libraries, guides, and blogs.",
    "aws-billing-alert-terraform": "Terraform module for setting up AWS billing alerts.",
    "AWS-DevOps_Real-Time_Deployment": "End-to-end AWS DevOps deployment pipeline from Dev to Production.",
    "devops-cheatsheet": "Quick-reference DevOps cheatsheets covering CI/CD, cloud, security, monitoring, and automation.",
    "DevOps-Interview-Questions": "550+ DevOps interview questions with detailed answers covering CI/CD, Kubernetes, Terraform, and cloud.",
    "into-the-devops": "Comprehensive DevOps interview guide covering Linux, AWS, Kubernetes, Terraform, Docker, and more."
  }
  